app/controllers/school_classes_controller.rb

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def find_class
    @school_class = SchoolClass.find(params[:id])