app/controllers/students_controller.rb

  def update
    @student.update(student_params(:first_name, :last_name))
---
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Ju"], ["updated_at", "2021-01-13 22:40:36.400282"], ["id", 4]]